# NewFilterName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterDialog..::..NewFilterName Property
FilterDialog Class See Also
---
The name of the new ParameterFilterElement to be created and selected once Show is invoked.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string NewFilterName { get; set; }
```

Visual Basic
---
```text
Public Property NewFilterName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ NewFilterName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: newFilterName is an empty string. -or- When setting this property: newFilterName cannot include prohibited characters, such as "{, }, [, ], | , ;, less-than sign, greater-than sign, ?, `, ~". -or- When setting this property: The supplied filter name newFilterName is not unique. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
FilterDialog Class
Autodesk.Revit.UI Namespace